import Card from "./AboutCard/AboutCard";
import styled from "styled-components";

const ListCard = () => {
  return (
    <List>
      <Card
        title="مدیریت"
        desc="ماموریت متا نکست اینست که توسعه کسب و کارها را سرعت بخشد و زمینه تسریع رشد هر کسب و کاری را در هر مکان و زمانی فراهم آورد. برای این منظور متا نکست با ارایه سامانه آنلاین و یکپارچه خود، زمینه رشد و توسعه سریع کسب و کارها را ایجاد می کند."
      />
      <Card
        title="مدیریت"
        desc="ماموریت متا نکست اینست که توسعه کسب و کارها را سرعت بخشد و زمینه تسریع رشد هر کسب و کاری را در هر مکان و زمانی فراهم آورد. برای این منظور متا نکست با ارایه سامانه آنلاین و یکپارچه خود، زمینه رشد و توسعه سریع کسب و کارها را ایجاد می کند."
      />
      <Card
        title="مدیریت"
        desc="ماموریت متا نکست اینست که توسعه کسب و کارها را سرعت بخشد و زمینه تسریع رشد هر کسب و کاری را در هر مکان و زمانی فراهم آورد. برای این منظور متا نکست با ارایه سامانه آنلاین و یکپارچه خود، زمینه رشد و توسعه سریع کسب و کارها را ایجاد می کند."
      />
    </List>
  );
};

const List = styled.div`
  display: flex;
  justify-content: center;
  align-items: center;
  flex-wrap: wrap;
  width: 100%;
`;

export default ListCard;
